app/controllers/authors/posts_controller.rb

INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "asdasd"], ["body", ""], ["description", ""], ["slug", ""], ["created_at", "2018-03-09 00:45:32.596441"], ["updated_at", "2018-03-09 00:45:32.596441"], ["banner_image_url", ""]]
---
    def create
      @post = current_author.posts.new(post_params)

      respond_to do |format|
        if @post.save

UPDATE "posts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["image_file_name", "cerveja.jpg"], ["image_file_size", 302643], ["image_updated_at", "2018-03-11 23:47:09.087122"], ["updated_at", "2018-03-11 23:47:09.448194"], ["id", 15]]
---
    def update
      respond_to do |format|
        if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 1], ["id", 7], ["LIMIT", 1]]
---
      def set_post
        @post = current_author.posts.friendly.find(params[:id])