app/controllers/blog/posts_controller.rb

    def index
      @posts = Post.most_recent.published.paginate(:page => params[:pagina], per_page: 6)
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = $1 ORDER BY "posts"."id" DESC  [["published", "t"]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."published" = $1 AND "posts"."published" = $2  [["published", "t"], ["published", "t"]]