app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("title", "author", "body", "created_at", "updated_at", "parent_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asd as das d"], ["author", "as das das d"], ["body", "as das d"], ["created_at", "2018-03-13 21:54:56.712603"], ["updated_at", "2018-03-13 21:54:56.712603"], ["parent_id", 1]]
---
	def create
	  if params[:comment][:parent_id].to_i > 0
	    parent = Comment.find_by_id(params[:comment].delete(:parent_id))
	    @comment = parent.children.build(comment_params)
	  else
	    @comment = Comment.new(comment_params)
	  end

	  if @comment.save